SaitovSP/src/Documents/ЗакрытиеСмены/ЗакрытиеСмены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗакрытиеСмены</name>
  <registerRecords>AccumulationRegister.ДенежныеСредстваСети</registerRecords>
  <attributes>
    <name>Ресторан</name>
    <type>
      <types>CatalogRef.Рестораны</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

SaitovSP/src/AccumulationRegisters/ДенежныеСредстваСети/ДенежныеСредстваСети.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДенежныеСредстваСети</name>
  <resources>
    <name>Выручка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Ресторан</name>
    <type>
      <types>CatalogRef.Рестораны</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

SaitovSP/src/Documents/ЗакрытиеСмены/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗакрытиеСмены.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗакрытиеСмены КАК ЗакрытиеСмены
		|ГДЕ
		|	ЗакрытиеСмены.Дата МЕЖДУ &ДатаНач И &ДатаКон
		|	И ЗакрытиеСмены.Ресторан = &Ресторан
		|	И ЗакрытиеСмены.Проведен
		|	И ЗакрытиеСмены.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Дата));
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(Дата));
	Запрос.УстановитьПараметр("Ресторан", Ресторан);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Сообщить("Смена уже закрыта");
		Отказ = Истина;
		
	КонецЕсли;
	
	Движения.ДенежныеСредстваСети.Записывать = Истина;
	Движение = Движения.ДенежныеСредстваСети.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Ресторан = Ресторан;
	Движение.Выручка = Сумма;

КонецПроцедуры
